/*---------------------------------------------------------------------------*
  Project:  TwlSDK - MB - include
  File:     mb.h

  Copyright 2007-2008 Nintendo. All rights reserved.

  These coded instructions, statements, and computer programs contain
  proprietary information of Nintendo of America Inc. and/or Nintendo
  Company Ltd., and are protected by Federal copyright law. They may
  not be disclosed to third parties or copied or duplicated in any form,
  in whole or in part, without the prior written consent of Nintendo.

  $Date:: 2008-10-17#$
  $Rev: 8984 $
  $Author: yosizaki $
 *---------------------------------------------------------------------------*/

#ifndef NITRO_MB_MB_H_
#define NITRO_MB_MB_H_

#ifdef __cplusplus
extern "C" {
#endif

#include <nitro/types.h>
#include <nitro/misc.h>
#include <nitro/fs/file.h>
#include <nitro/wm.h>


/* ---------------------------------------------------------------------

        Constants

   ---------------------------------------------------------------------*/

#define MB_MAX_CHILD                    WM_NUM_MAX_CHILD

/* Number of characters in file name */
#define MB_FILENAME_SIZE_MAX            (10)

/* Maximum number of files in parent device */
#define MB_MAX_FILE                     (16)

/* Size of multiboot working memory */
#define MB_SYSTEM_BUF_SIZE              (0xC000)

/* Possible size setting range for parent communication */

#define MB_SUCCESS                      MB_ERRCODE_SUCCESS      // Backwards compatibility

/* Definition value that specifies that the TGID value for MB_Init() should be automatically set */
#define	MB_TGID_AUTO	0x10000

/*
 * Parent device game information for multibooting
 */

#define MB_ICON_COLOR_NUM               16      // Number of icon colors
#define MB_ICON_PALETTE_SIZE            (MB_ICON_COLOR_NUM * 2) // Icon data size (16-bit color x number of colors)
#define MB_ICON_DATA_SIZE               512     // Icon data size (32x32 dots, 16 colors)
#define MB_GAME_NAME_LENGTH             48      // Game name length (2-byte units)   Note: Specify to fit within the number of characters noted on the left *and* within a width of 185 dots.
#define MB_GAME_INTRO_LENGTH            96      // Game description length (2-byte units)   Note: Specify to fit within the number of characters noted on the left *and* within a width of 199 dots times 2.
#define MB_USER_NAME_LENGTH             10      // User name length (2-byte units)
#define MB_MEMBER_MAX_NUM               15      // Maximum number of communicating members
#define MB_FILE_NO_MAX_NUM              64      // When MbGameInfo.fileNo is carried on the beacon it becomes 6-bit. Therefore the maximum number is 64.
#define MB_GAME_INFO_RECV_LIST_NUM      16      // Number of lists that receive game information on the child side.

/* Boot type */
#define MB_TYPE_ILLEGAL                 0       /* Illegal status */
#define MB_TYPE_NORMAL                  1       /* Boot from ROM */
#define MB_TYPE_MULTIBOOT               2       /* Multiboot child device */

#define MB_BSSDESC_SIZE                 (sizeof(MBParentBssDesc))
#define MB_DOWNLOAD_PARAMETER_SIZE      HW_DOWNLOAD_PARAMETER_SIZE

/* Parent download status */
typedef enum
{
    MB_COMM_PSTATE_NONE,
    MB_COMM_PSTATE_INIT_COMPLETE,
    MB_COMM_PSTATE_CONNECTED,
    MB_COMM_PSTATE_DISCONNECTED,
    MB_COMM_PSTATE_KICKED,
    MB_COMM_PSTATE_REQ_ACCEPTED,
    MB_COMM_PSTATE_SEND_PROCEED,
    MB_COMM_PSTATE_SEND_COMPLETE,
    MB_COMM_PSTATE_BOOT_REQUEST,
    MB_COMM_PSTATE_BOOT_STARTABLE,
    MB_COMM_PSTATE_REQUESTED,
    MB_COMM_PSTATE_MEMBER_FULL,
    MB_COMM_PSTATE_END,
    MB_COMM_PSTATE_ERROR,
    MB_COMM_PSTATE_WAIT_TO_SEND,

    /* Internally used enumerated values.
       Will not transition to these value's states. */
    MB_COMM_PSTATE_WM_EVENT = 0x80000000
}
MBCommPState;


/* Responses to connection request from child */
typedef enum
{
    MB_COMM_RESPONSE_REQUEST_KICK,     /* Reject child's entry request. */
    MB_COMM_RESPONSE_REQUEST_ACCEPT,   /* Accept child's entry request. */
    MB_COMM_RESPONSE_REQUEST_DOWNLOAD, /* Notify child of commencement of download. */
    MB_COMM_RESPONSE_REQUEST_BOOT      /* Notify child of commencement of boot. */
}
MBCommResponseRequestType;


/*  Parent event notification callback type */
typedef void (*MBCommPStateCallback) (u16 child_aid, u32 status, void *arg);


typedef struct
{
    u16     errcode;
}
MBErrorStatus;

typedef enum
{
    /* Value that indicates success */
    MB_ERRCODE_SUCCESS = 0,

    MB_ERRCODE_INVALID_PARAM,          /* Argument error */
    MB_ERRCODE_INVALID_STATE,          /* Inconsistent call state conditions */

    /* The following errors are only for children. */
    MB_ERRCODE_INVALID_DLFILEINFO,     /* Invalid download information */
    MB_ERRCODE_INVALID_BLOCK_NO,       /* Received block number is invalid */
    MB_ERRCODE_INVALID_BLOCK_NUM,      /* Number of blocks in received file is invalid */
    MB_ERRCODE_INVALID_FILE,           /* Received block from file that was not requested */
    MB_ERRCODE_INVALID_RECV_ADDR,      /* Receive address is invalid */

    /* The following errors are caused by WM errors. */
    MB_ERRCODE_WM_FAILURE,             /* Error in WM callback */

    /** The following are for when it is not possible to continue communications. (Must re-initialize WM) **/
    MB_ERRCODE_FATAL,

    MB_ERRCODE_MAX
}
MBErrCode;

/* ---------------------------------------------------------------------

        Structures

   ---------------------------------------------------------------------*/

/*
 * Structure with registration data for multiboot games
 */
typedef struct
{
    /* Program binary's file path */
    const char *romFilePathp;
    /* Pointer to game name string */
    u16    *gameNamep;
    /* Pointer to game content description string */
    u16    *gameIntroductionp;
    /* Icon character data file path */
    const char *iconCharPathp;
    /* Icon palette data file path */
    const char *iconPalettePathp;
    /* Game group ID */
    u32     ggid;
    /* Max number of players */
    u8      maxPlayerNum;
    u8      pad[3];
    /* User definition extended parameters (32 bytes) */
    u8      userParam[MB_DOWNLOAD_PARAMETER_SIZE];
}
MBGameRegistry;


/*
 * Icon data structure
 * An icon uses a 16-color palette and is 32x32 pixels.
 */
typedef struct
{
    /* Palette data (32 bytes) */
    u16     palette[MB_ICON_COLOR_NUM];
    u16     data[MB_ICON_DATA_SIZE / 2];
    /* Character data (512 bytes) */
}
MBIconInfo;                            /* 544 bytes */


/*
 * User information structure
 */
typedef struct
{
    /* Favorite color data (color set number) */
    u8      favoriteColor:4;
    /* Player number (Parent = #0, Children = #1-#15) */
    u8      playerNo:4;
    /* Nickname Length */
    u8      nameLength;
    /* Nickname */
    u16     name[MB_USER_NAME_LENGTH];
}
MBUserInfo;                            /* 22 bytes */


/*
 * Multiboot parent device information
 * (excluding gameInfo[128] from WMbssDesc)
 */
typedef struct
{
    u16     length;                    // 2
    u16     rssi;                      // 4
    u16     bssid[3];                  // 10
    u16     ssidLength;                // 12
    u8      ssid[32];                  // 44
    u16     capaInfo;                  // 46
    struct
    {
        u16     basic;                 // 48
        u16     support;               // 50
    }
    rateSet;
    u16     beaconPeriod;              // 52
    u16     dtimPeriod;                // 54
    u16     channel;                   // 56
    u16     cfpPeriod;                 // 58
    u16     cfpMaxDuration;            // 60
}
MBParentBssDesc;


/* Structure that holds parent information for a multiboot child */
typedef struct
{
    u16     boot_type;
    MBParentBssDesc parent_bss_desc;
}
MBParam;


/* Data type received when entry request comes from child */
typedef struct
{
    u32     ggid;                      //  4 bytes
    MBUserInfo userinfo;               // 22 bytes
    u16     version;                   //  2 bytes
    u8      fileid;                    //  1 byte
    u8      pad[3];                    // Total: 29 bytes
}
MBCommRequestData;


/* ---------------------------------------------------------------------

        Multiboot library (MB) API - For parent device

   ---------------------------------------------------------------------*/

/*---------------------------------------------------------------------------*
  Name:         MB_Init

  Description:  Initialize MB library

